outputs/openfoam_cases/0001/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            -1;

seaLevelAsReference true;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   200;
    Tsoft               24;
    Hs                  5.76;
    Tp                  8.89;
    gamma               3.3;
    depth               14.1;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
201
(
6.86041e-142
1.94849e-121
1.80393e-104
2.64221e-90
2.09397e-78
2.35763e-68
8.09551e-60
1.5587e-52
...
)
;

    fspectrum       nonuniform List<scalar> 
201
(
0.0277778
0.0288508
0.0299237
0.0309962
0.0320682
0.0331395
0.03421
0.0352794
...
)
;

    amplitude           nonuniform List<scalar>
    200
    (
        1.44595e-62
        4.39927e-54
        5.32335e-47
        4.73785e-41
        5.02568e-36
        9.30904e-32
        4.08277e-28
        5.41393e-25
...
    );
    frequency           nonuniform List<scalar>
    200
    (
        0.0283143
        0.0293873
        0.0304599
        0.0315322
        0.0326039
        0.0336747
        0.0347447
        0.0358135
...
    );
    phaselag            nonuniform List<scalar>
    200
    (
        1.12089
        2.51125
        1.04677
        1.3328
        0.389154
        0.340234
        1.73206
        0.300068
...
    );
    waveNumber          nonuniform List<vector>
    200
    (
        (0.0152423 0 0)
        (0.0158292 0 0)
        (0.0164171 0 0)
        (0.0170058 0 0)
        (0.0175953 0 0)
        (0.0181856 0 0)
        (0.0187766 0 0)
        (0.0193682 0 0)
...
    );

    frequencyAxis
    {
        discretisation      cosineStretchedFrequencyAxis;
        lowerFrequencyCutoff 0.0277778;
        upperFrequencyCutoff 0.25;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 400 0 1 );
        orientation         ( 1 0 0 );
        fieldNames          ( alpha.water U );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               24;
}



// ************************************************************************* //
